In [2]:
import pandas as pd

In [3]:
pd.Index(["i1", "i2"], name="foo")

Index(['i1', 'i2'], dtype='object', name='foo')

In [3]:
df = pd.DataFrame([[1, 2], [4, 5], [7, 8]],

                  index=['cobra', 'viper', 'sidewinder'],

                  columns=['max_speed', 'shield'])

In [4]:
df

            max_speed  shield
cobra               1       2
viper               4       5
sidewinder          7       8

In [11]:
df.loc[:,["max_speed", "shield"]].value_counts().reset_index()

   max_speed  shield  count
0          1       2      1
1          4       5      1
2          7       8      1

In [14]:
df.value_counts().reset_index()

   max_speed  shield  count
0          1       2      1
1          4       5      1
2          7       8      1

In [11]:
print(type(df.loc[df["shield"] > 6, ["max_speed"]]))
print(type(df.loc[df["shield"] > 6, "max_speed"]))

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.series.Series'>

In [57]:
mydict = [{'a': 1, 'b': 2, 'c': 3, 'd': 4},

          {'a': 100, 'b': 200, 'c': 300, 'd': 400},

          {'a': 1000, 'b': 2000, 'c': 3000, 'd': 4000}]

df = pd.DataFrame(mydict)
df

      a     b     c     d
0     1     2     3     4
1   100   200   300   400
2  1000  2000  3000  4000

In [60]:
df.size()

TypeError: 'int' object is not callable

In [38]:
df.groupby(["a"]).b.agg(["min", "max"])
# df.groupby(["a"]).count()

       min   max
a
1        2     2
100    200   200
1000  2000  2000

In [44]:
ii = df.groupby(["a"])[["b", "c"]].agg(["min", "max"])
type(ii)
# ii.columns

pandas.core.frame.DataFrame

In [47]:
['_'.join(c) for c in ii.columns]

['b_min', 'b_max', 'c_min', 'c_max']

In [33]:
df.a.agg(["min", "max"])

min       1
max    1000
Name: a, dtype: int64

In [13]:
df.iloc[lambda x: x.index % 2 == 0]

      a     b     c     d
0     1     2     3     4
2  1000  2000  3000  4000

In [17]:
df.index % 2 == 0

array([ True, False,  True])

In [18]:
df

      a     b     c     d
0     1     2     3     4
1   100   200   300   400
2  1000  2000  3000  4000

In [20]:
df.loc[0] = [4,3,2,1]

In [22]:
df.loc[:,"a"] = [1000, 100, 1]

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       3 non-null      int64
 1   b       3 non-null      int64
 2   c       3 non-null      int64
 3   d       3 non-null      int64
dtypes: int64(4)
memory usage: 228.0 bytes

In [25]:
df.a.info()

<class 'pandas.core.series.Series'>
RangeIndex: 3 entries, 0 to 2
Series name: a
Non-Null Count  Dtype
--------------  -----
3 non-null      int64
dtypes: int64(1)
memory usage: 156.0 bytes

In [31]:
df

      a     b     c     d
0  1000     3     2     1
1   100   200   300   400
2     1  2000  3000  4000

In [39]:
df.groupby(["a"]).b.count()

a
1       1
100     1
1000    1
Name: b, dtype: int64

In [82]:
df_new = df.groupby(["a", "b"]).agg(["min"])
df_new
df_new.reset_index()

      a     b     c     d
                min   min
0     1  2000  3000  4000
1   100   200   300   400
2  1000     3     2     1

In [48]:
df.groupby(["a", "b"]).a.count().index

MultiIndex([(   1, 2000),
            ( 100,  200),
            (1000,    3)],
           names=['a', 'b'])

In [53]:
df.a.idxmax(axis="index")

0

In [55]:
df

      a     b     c     d
0  1000     3     2     1
1   100   200   300   400
2     1  2000  3000  4000

In [60]:
df_new = df.rename(index={0: "row0", 1: "row1", 2: "row2"})

In [62]:
df_new.idxmax()

a    row0
b    row2
c    row2
d    row2
dtype: object

In [59]:
df

      a     b     c     d
0  1000     3     2     1
1   100   200   300   400
2     1  2000  3000  4000

In [53]:
import numpy as np

df = pd.DataFrame({"col": [1, np.nan]})

In [56]:
df

   col
0  1.0
1  NaN

In [55]:
df.dtypes

col    float64
dtype: object